docs/org/index.org
#+AUTHOR:   Sina Samavati
#+EMAIL:    sina.samv@gmail.com
#+OPTIONS:  toc:nil
#+TITLE:    Leptus Documentation

* Table of Contents
   :PROPERTIES:
   :CUSTOM_ID: toc
   :END:

   - [[#quick-overview][Quick Overview]]
   - [[file:types.org][Types]]

   - [[file:callbacks.org][Callbacks]]
     - [[file:callbacks.org::#prefix-0][prefix/0]]
     - [[file:callbacks.org::#init-3][init/3]]
     - [[file:callbacks.org::#cross_domains-3][cross_domains/3]]
     - [[file:callbacks.org::#is_authenticated-3][is_authenticated/3]]
     - [[file:callbacks.org::#has_permission-3][has_permission/3]]
     - [[file:callbacks.org::#httpmethod-3][HttpMethod/3]]
     - [[file:callbacks.org::#terminate-4][terminate/4]]

   - [[file:configuration.org][Configuration]]
     - [[file:configuration.org::#handlers][handlers]]
     - [[file:configuration.org::#options][options]]

   - Modules
     - [[file:leptus.org][leptus]]
     - [[file:leptus_config.org][leptus_config]]
     - [[file:leptus_logger.org][leptus_logger]]
     - [[file:leptus_router.org][leptus_router]]
     - [[file:leptus_utils.org][leptus_utils]]

* Quick Overview
   :PROPERTIES:
   :CUSTOM_ID: quick-overview
   :END:

   #+BEGIN_SRC
   -module(hello).
   -compile({parse_transform, leptus_pt}).

   %% leptus callbacks
   -export([init/3]).
   -export([get/3]).
   -export([terminate/4]).

   init(_Route, _Req, State) ->
       {ok, State}.

   get("/", _Req, State) ->
       {<<"Hello, leptus!">>, State};
   get("/hi/:name", Req, State) ->
       Status = ok,
       Name = leptus_req:param(Req, name),
       Body = #{<<"say">> => <<"Hi">>, <<"to">> => Name},
       {Status, Body, State}.

   terminate(_Reason, _Route, _Req, _State) ->
       ok.
   #+END_SRC

   Note the use of the following in your request/resource handler module.
   #+BEGIN_SRC
   -compile({parse_transform, leptus_pt}).
   #+END_SRC

   Let's compile, and run the example above.

   #+BEGIN_SRC
   $ erl -pa ebin deps/*/ebin
   #+END_SRC

   #+BEGIN_SRC
   > c(hello).
   > leptus:start_listener(http, [{'_', [{hello, undefined_state}]}]).
   Leptus started on http://127.0.0.1:8080
   #+END_SRC

   #+BEGIN_SRC
   $ curl localhost:8080/hi/Leptus
   {"say":"Hi","to":"Leptus"}
   #+END_SRC
